[
  {
    "id": 1,
    "answer": 2013
  },
  {
    "id": 1,
    "answer": 2006
  },
  {
    "id": 1,
    "answer": 2003,
    "correct": "The Cougars came close a couple of times, most notably in 2006 when they finished with a 6-6 record, and in 2013, when they blew a 22 point lead in the New Mexico Bowl to finish 6-7."
  },
  {
    "id": 1,
    "answer": 2001
  },
  {
    "id": 2,
    "answer": "Rueben Mayes",
    "correct": "Mayes led the way for Washington State, as he rushed for what was at the time an NCAA-record 357 yards on 39 carries to lead the Cougars to a 50-41 win over the Ducks"
  },
  {
    "id": 2,
    "answer": "Chris Ivory"
  },
  {
    "id": 2,
    "answer": "Jerome Harrison"
  },
  {
    "id": 2,
    "answer": "Steve Broussard"
  },
  {
    "id": 3,
    "answer": "Patriots"
  },
  {
    "id": 3,
    "answer": "Rams"
  },
  {
    "id": 3,
    "answer": "Jaguars"
  },
  {
    "id": 3,
    "answer": "Saints"
  },
  {
    "id": 3,
    "answer": "Cardinals",
    "correct": "Bucannon tallied 363 punishing tackles and 11 interceptions while roaming the backfield at WSU. He was drafted in the first round by the Arizona Cardinals in 2014."
  },
  {
    "id": 4,
    "answer": "Connor Halliday",
    "correct": "Halliday threw for 4,597 yards in the 2013 season. Falk came up just short of that total in 2015, racking up 4,561 yards."
  },
  {
    "id": 4,
    "answer": "Drew Bledsoe"
  },
  {
    "id": 4,
    "answer": "Alex Brink"
  },
  {
    "id": 4,
    "answer": "Ryan Leaf"
  },
  {
    "id": 5,
    "answer": "Brandon Gibson"
  },
  {
    "id": 5,
    "answer": "Marquess Wilson",
    "correct": "Wilson racked up 3,207 receiving yards over his three years playing at WSU. Marks already has 2,559 yards, good enough for fourth on the Washington State all-time list."
  },
  {
    "id": 5,
    "answer": "Jason Hill"
  },
  {
    "id": 5,
    "answer": "Hugh Campbell"
  },
  {
    "id": 6,
    "answer": "Colorado State in the 2013 New Mexico Bowl"
  },
  {
    "id": 6,
    "answer": "Oklahoma in the 2003 Rose Bowl (2002 season)"
  },
  {
    "id": 6,
    "answer": "Texas in the 2003 Holiday Bowl",
    "correct": "WSU pulled off a major upset, as Texas came into the game as the No. 5 team in the country. The Cougars scored 19 unanswered points in the third quarter to turn a 10-7 deficit into a 26-10 lead, eventually winning the game 28-20."
  },
  {
    "id": 6,
    "answer": "Nebraska in the 2007 Poinsettia Bowl"
  },
  {
    "id": 7,
    "answer": "Quillip the Hedgehog"
  },
  {
    "id": 7,
    "answer": "Squirt the Terrier",
    "correct": "Squirt the Terrier became the mascot when someone brought a dog to campus early in the 20th century. From 1910-1919, the mascot became the Indians, and in October 1919 WSU settled on the cougar as the official mascot."
  },
  {
    "id": 7,
    "answer": "Earl the Eagle"
  },
  {
    "id": 7,
    "answer": "Ferdinand the Dairy Cow"
  },
  {
    "id": 8,
    "answer": "The cougar was named an endangered species, so the United States Fish and Wildlife Service asked them to stop."
  },
  {
    "id": 8,
    "answer": "When the cougar died just before the 1979 season, they couldn't find another one in time so they swtiched to a human mascot."
  },
  {
    "id": 8,
    "answer": "There was a student vote, and the student body voted to discontinue the tradition.",
    "correct": "n August of 1978, Butch VI died. This prompted a debate on whether the tradition should continue, and a survey of 403 students found that 63 percent of students opposed another live cougar. Because of that, WSU President Glenn Terrell decided to end the tradition."
  },
  {
    "id": 8,
    "answer": "The last cougar, Butch VI, attacked a student on the way to a game, so the school decided it was no longer safe."
  },
  {
    "id": 9,
    "answer": "Most pass attempts"
  },
  {
    "id": 9,
    "answer": "Most passing touchdowns"
  },
  {
    "id": 9,
    "answer": "Highest completion percentage"
  },
  {
    "id": 9,
    "answer": "Most yards of total offense",
    "correct": "Halliday has comfortable leads in attempts and touchdowns, and his 62.0 percent career completion percentage is slightly higher than Jeff Tuel’s 61.4 percent. But Halliday comes up short in career yards of total offense with 10,812, just 199 yards behind Alex Brink with 11,011."
  },
  {
    "id": 10,
    "answer": "Idaho",
    "correct": "The University of Idaho was the first team WSU ever played -- a 10-0 Cougars win in 1894. WSU has continued to dominate the series ever since, holding a 71-17-3 all time record against the Vandals."
  },
  {
    "id": 10,
    "answer": "Oregon State"
  },
  {
    "id": 10,
    "answer": "Montana State"
  },
  {
    "id": 10,
    "answer": "UW"
  },
  {
    "id": 12,
    "answer": "Jerome Harrison"
  },
  {
    "id": 12,
    "answer": "Connor Halliday",
    "correct": "Halliday received some Heisman buzz in 2013, but he never made it into the top 10. In his junior season, he threw for 4,597 yards, but his 22 interceptions may have held him back in the eyes of voters. The next year, he seemed to be in the discussion again, but a broken leg suffered in November ended any hopes he add of a Heisman."
  },
  {
    "id": 12,
    "answer": "Drew Bledsoe"
  },
  {
    "id": 12,
    "answer": "Ryan Leaf"
  },
  {
    "id": 12,
    "answer": "Rueben Mayes"
  },
  {
    "id": 11,
    "answer": "Mike Leach"
  },
  {
    "id": 11,
    "answer": "Babe Hollingbery"
  },
  {
    "id": 11,
    "answer": "Dennis Erickson"
  },
  {
    "id": 11,
    "answer": "Bill Doba"
  },
  {
    "id": 11,
    "answer": "Mike Price",
    "correct": "Though Babe Hollingbery holds the WSU record for most wins as a head coach, Mike Price led the Cougs in their golden era -- taking the team to two Rose Bowls and a No. 3 ranking in 2002."
  },
  {
    "id": 13,
    "answer": "Deron Pointer"
  },
  {
    "id": 13,
    "answer": "C.J. Davis"
  },
  {
    "id": 13,
    "answer": "Tim Stallworth"
  },
  {
    "id": 13,
    "answer": "Phillip Bobo",
    "correct": "In blizzard-like conditions with WSU trailing 7-6 in the third quarter of the game that would come to be known as the 'Snow Bowl,' Bledsoe hit Bobo on a 44-yard touchdown pass. Bobo slid into a pile of snow by the goalposts, and the catch sparked a 29-point third quarter that carried the Cougars to a 42-23 win and gave UW just their second loss of the season."
  },
  {
    "id": 14,
    "answer": "Running back James Matthews returned a kickoff 98 yards with 34 seconds to go to give WSU a one-point win"
  },
  {
    "id": 14,
    "answer": "Huskies kicker Chuck Nelson missed a 33 yard field goal attempt that would have given UW the lead late in the game",
    "correct": "WSU came in with only two wins, while UW was 9-1 and ranked No. 5 in the nation. But Nelson, who hadn't missed a kick all year, pushed a 33-yarder that would have given UW the lead wide right with less than four minutes to play, and the Cougars went on to complete the upset, 24-20."
  },
  {
    "id": 14,
    "answer": "UW turned the ball over an Apple Cup-record eight times, and WSU cruised to a 27-6 win"
  },
  {
    "id": 14,
    "answer": "Cougars kicker John Traut hit a 48-yard field goal as time expired to give WSU a come-from-behind win"
  },
  {
    "id": 15,
    "answer": "Ryan Leaf"
  },
  {
    "id": 15,
    "answer": "Drew Bledsoe"
  },
  {
    "id": 15,
    "answer": "Jason Gesser",
    "correct": "Jason Gesser won 14 of the 22 games he started for the Cougs, racking up 5,422 yards and 42 touchdowns over his four seasons."
  },
  {
    "id": 15,
    "answer": "Mark Rypien"
  }
]